#Άσκηση 4-6

#ΠΡΟΣΟΧΗ! για να λύσω την άσκηση βρήκα 3 διαφορετικούς τρόπους
#Με βάση την λεπτομέρεια που διαβάζω στην άσκηση, κρίνω την άσκηση ασαφής.


#Τρόπος 1 (Εδώ κάνουμε λίστα χωρίς την χρήση του "for")

digits = list(range(1, 21, 2))
print(digits)


#Τρόπος 2 (Εδώ ΔΕΝ κάνουμε λίστα, αλλά χρησιμοποιούμε το "for")

for x in range(1, 21, 2):
    print(x)


#Τρόπος 3 (Εδώ κάνουμε λίστα ΚΑΙ χρησιμοποιούμε το "for")

digits = []
for x in range(1, 21, 2):
    digits.append(x)
    print(x)


#Αν έπρεπε να επιλέξω έναν τρόπο για να απαντήσω ΣΩΣΤΑ (ΣΑΦΕΣ) στην άσκηση, θα επέλεγα τον 3ο τρόπο.
