# Άσκηση 7-10

results = []

dream_visit = input("If you could visit one place in the world, where would "
                    "you go? ")

results.append(dream_visit)

print(results)

# Το μόνο που έφτιαξα είναι συλλογή αποτελεσμάτων της έρευνας από έναν χρήστη

# Δεν μπόρεσα να την λύσω
# Ή η άσκηση δεν είναι σαφής, ή εγώ δεν αντιλαμβάνομαι πλήρως το ζητούμενο
# Η άσκηση καταλαβαίνω πως ζητάει το εξής:
# 1. Να ρωτήσουμε (με input) σε ποιο μέρος θέλουν να πάνε οι χρήστες
# 2. Να εμφανίσουμε τα αποτελέσματα (απαντήσεις) των χρηστών

# Αυτό πως θα γίνει; Αφού με το input ρωτάμε μόνο έναν χρήστη (εμάς, που...
# ...τρέχουμε το πρόγραμμα). Οπότε θα συλλέξουμε μόνο μία απάντηση, όχι πολλές
# Άρα πως θα κάνουμε πολλά input και να απαντάμε εκ μέρους διάφορων χρηστών

