#Άσκηση 6-4 (Από 6-3)

γλωσσάρι = {
    'αλγόριθμος': 'Σειρά σαφών εντολών προς εκτέλεση',
    'δεδομένα': 'Πληροφορίες που θέτουμε ώς σωστές',
    'τιμη': 'Αυτοεξηγούμενο',
    'μεταβλητή': 'Ένα όρισμα το οποίο έχει ως τιμή ό,τι ορίσουμε εμείς',
    'string': 'Συμβολοσειρά'
    }

for variable in γλωσσάρι:
    print(f"{variable.title()}: {γλωσσάρι[variable]}.\n")

# Μου ζητάει να τα κάνω print με loop
# Εγώ όμως ήδη την ειχα λύσει με print την 6-3
# Μάλλον περίμεναν να κάνω μία σειρά print για κάθε κλειδί-τιμή
# Οπότε ειναι ήδη λυμένη η 6-4
